import React, { Component } from 'react';
import { Text } from 'react-native';
styles = require('../../assets/Style');

class HomeMsg extends Component {
    state = {  }
    render() {
        return (
            <Text style={ styles.bodyText }>
                เสียงกู่จากครูใหญ่เป็นประสบการณ์จริงในช่วงหนึ่งของชีวิตผมที่เคยดำรงตำแหน่ง
                ครูใหญ่โรงเรียนประชาบาลอยู่ 5 ปีเศษ ผมตั้งใจจะถ่ายทอดแนวคิดและยุทธวิธีการทำงานท่ามกลางความขาดแคลน 
                สู่นักพัฒนาและผู้สนใจการพัฒนา ผมได้ใส่ภาพประกอบเพิ่มเข้าไปเกือบทุกตอน เพื่อที่จะให้ผู้อ่านได้มองเห็นกิจกรรมและความ
                เปลี่ยนแปลงที่เริ่มจากไม่มีอะไรเลย จนกลายเป็นโรงเรียน ที่สง่างามภายในเวลา 5 ปี หากความดีของหนังสือเล่มนี้มีอยู่ 
                ขอมอบให้แก่ชาวบ้านและคณะครูที่ร่วมมือร่วมใจกันทุ่มเท เสียสละทั้งกำลังกาย กำลังใจและกำลังทรัพย์ 
                จนทำให้เกิดผลงานเหล่านี้ขึ้น
            </Text>
        );
    }
}

export default HomeMsg;